{"keras_version": "2.1.6-tf", "config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "strides": [4, 4], "activation": "linear", "filters": 64, "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [11, 11], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "kernel_regularizer": null, "batch_input_shape": [null, 300, 300, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_7", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_5", "strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_6", "axis": [3], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "strides": [1, 1], "activation": "linear", "filters": 64, "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_8", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_6", "strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_7", "axis": [3], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "strides": [1, 1], "activation": "linear", "filters": 64, "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_9", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_7", "strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_8", "axis": [3], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "strides": [1, 1], "activation": "linear", "filters": 64, "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_10", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_8", "strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_9", "axis": [3], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "strides": [1, 1], "activation": "linear", "filters": 64, "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_9", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_11", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_9", "strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_10", "axis": [3], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "batch_input_shape": [null, 270000], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 512}, "class_name": "Dense"}, {"config": {"name": "activation_12", "activation": "relu", "dtype": "float32", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "trainable": true, "dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_11", "axis": [1], "scale": true, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 12}, "class_name": "Dense"}, {"config": {"name": "activation_13", "activation": "softmax", "dtype": "float32", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}