{"config": {"layers": [{"config": {"padding": "same", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d", "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activation": "linear", "batch_input_shape": [null, 300, 300, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 16, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_1", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_2", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_4", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_3", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_5", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_4", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_6", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_5", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_7", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 64, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_6", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_8", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_7", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_9", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_8", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_10", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 128, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_9", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_11", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 256, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_10", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_12", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 256, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_11", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_13", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "filters": 256, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "flatten", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "trainable": true, "name": "dense", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "units": 2048, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "name": "batch_normalization", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "name": "dropout", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "units": 12, "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "scale": true, "momentum": 0.99, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_15", "activation": "softmax"}, "class_name": "Activation"}], "name": "sequential"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf"}