{"config": {"layers": [{"config": {"padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [4, 4], "filters": 96, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [11, 11], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "batch_input_shape": [null, 300, 300, 3], "name": "conv2d_10"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_6", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [3], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_14"}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "filters": 256, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [11, 11], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_11"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_7", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [3], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_15"}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "filters": 384, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_12"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [3], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_16"}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "filters": 384, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_13"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_19", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [3], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_17"}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "filters": 256, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d_14"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_8", "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [3], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_18"}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "units": 4096, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "batch_input_shape": [null, 150528], "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_6", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_21", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_4", "dtype": "float32", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [1], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_19"}, "class_name": "BatchNormalization"}, {"config": {"bias_regularizer": null, "units": 4096, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_7", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_22", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_5", "dtype": "float32", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": [1], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "scale": true, "name": "batch_normalization_20"}, "class_name": "BatchNormalization"}, {"config": {"bias_regularizer": null, "units": 12, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_8", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_23", "activation": "softmax"}, "class_name": "Activation"}], "name": "sequential_2"}, "backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Sequential"}